Revit 2027 API
BuiltInFailures.RoomFailures.RoomTagDeleted Property
 A [Room] Tag was deleted, but the corresponding [Room] still exists. You can place another tag for the [Room] using the [Room] Tag tool or select the [Room] and delete it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomTagDeleted { get; }
Public Shared ReadOnly Property RoomTagDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomTagDeleted {
	FailureDefinitionId^ get ();
}
static member RoomTagDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace